In [25]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [26]:
#function to create a server connection
def server_conn(host_name,user_name,user_password):
    connection = None
    try:
        connection = mysql.connector.connect(host = host_name,
                                             user = user_name,
                                             passwd = user_password)
        print('Server connection Established')
    except Error as err:
        print('Error-' , err)
    return connection

connection = server_conn("localhost","root","725@Mysql")
print(connection)

Server connection Established
<mysql.connector.connection.MySQLConnection object at 0x7fbf8f6e0b10>

In [27]:
#function to create a database
def create_db(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database Connection Created Successfully")
    except Error as err:
        print('Error-' , err)
        
database_create_query = "create database mydb_emp"
create_db(connection,database_create_query)

Database Connection Created Successfully

In [28]:
#function to connect with database
def db_conn(host_name,user_name,user_password,dbname):
    connection = None
    try:
        connection = mysql.connector.connect(host = host_name,
                                             user = user_name,
                                             passwd = user_password,
                                             database=dbname)
        print('Database connection Established')
    except Error as err:
        print('Error-' , err)
    return connection

connection = db_conn("localhost","root","725@Mysql","mydb_emp")
print(connection)

Database connection Established
<mysql.connector.connection.MySQLConnection object at 0x7fbf8f6eb6d0>

In [29]:
#function to execute sql querries
def execute_query(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('Query Executed')
    except Error as err:
        print("Error:-",err)

In [30]:
#create a table to maintain product order history
create_ord_table = """
create table emp_details(
e_id INT AUTO_INCREMENT primary key,
e_name varchar(35),
e_salary INTEGER(6),
e_age int,
e_gender varchar(35),
e_dept varchar(25));
"""

#database connection
connection = db_conn("localhost","root","725@Mysql","mydb_emp")
#execute query
execute_query(connection,create_ord_table)

Database connection Established
Query Executed

In [32]:
#Insert the data into the table
emp_info = """
insert into emp_details (e_name,e_salary,e_age,e_gender,e_dept)
values 
('John' , 95000 , 45 , 'Male' , 'Operations'),

('Vinay' , 80000 , 22 , 'Male' , 'Support'),

('Bipul' , 120000 , 30 , 'Male' , 'Analytics'),

('Anne' , 112000 , 25 , 'Female' , 'Sales'),

('Jerry' , 72000 , 28 , 'Female' , 'Support'),

('Ankita' , 88000 , 26 , 'Female' , 'Operations') 
"""

connection = db_conn("localhost","root","725@Mysql","mydb_emp")
execute_query(connection,emp_info)

Database connection Established
Query Executed

In [33]:
#Function Read the data table

def read_table(connection,query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print("Error-" , err)

In [35]:
#Execute Read function
read_query = "select * from emp_details"
connection = db_conn("localhost","root","725@Mysql","mydb_emp")
results = read_table(connection,read_query)
for res in results:
    print(res)

Database connection Established
(1, 'John', 95000, 45, 'Male', 'Operations')
(2, 'Vinay', 80000, 22, 'Male', 'Support')
(3, 'Bipul', 120000, 30, 'Male', 'Analytics')
(4, 'Anne', 112000, 25, 'Female', 'Sales')
(5, 'Jerry', 72000, 28, 'Female', 'Support')
(6, 'Ankita', 88000, 26, 'Female', 'Operations')

In [36]:
db_info = []

for res in results:
    db_info.append(list(res))

col_names = ['emp_Id','Name','Salary','Age','Gender','Operations']

df = pd.DataFrame(db_info,columns=col_names)
df

   emp_Id    Name  Salary  Age  Gender  Operations
0       1    John   95000   45    Male  Operations
1       2   Vinay   80000   22    Male     Support
2       3   Bipul  120000   30    Male   Analytics
3       4    Anne  112000   25  Female       Sales
4       5   Jerry   72000   28  Female     Support
5       6  Ankita   88000   26  Female  Operations

**Types of Functions**
* Basic function
* String Function
* Case Function
* IF Function
* User-Defined Function

**Basic Function**

* min() - gives smallest value

In [37]:
min_age = "select min(e_age) from emp_details;"
connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,min_age)
for res in results:
    print(res)

Database connection Established
(22,)

* max() - gives largest value

In [38]:
max_age = "select max(e_age) from emp_details;"
connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,max_age)
for res in results:
    print(res)

Database connection Established
(45,)

In [39]:
max_salary = "select max(e_salary) from emp_details;"
connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,max_salary)
for res in results:
    print(res)

Database connection Established
(120000,)

* count() - returns number rows matching a specific criteria

In [42]:
count_female = "select count(*) from emp_details where e_gender = 'Female'"
#count_male = "select count(*) from emp_details where e_gender = 'Male'"
#count_table = "select count(*) from emp_details"

connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,count_female)
for res in results:
    print(res)

Database connection Established
(3,)

* sum() - returns total sum of a numeric column

In [43]:
sum_salary = "select sum(e_salary) from emp_details"
connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,sum_salary)
for res in results:
    print(res)

Database connection Established
(Decimal('567000'),)

* avg() - returns average value of a numeric column

In [44]:
avg_salary = "select avg(e_salary) from emp_details"
connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,avg_salary)
for res in results:
    print(res)

Database connection Established
(Decimal('94500.0000'),)

In [45]:
avg_age = "select avg(e_age) from emp_details"
connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,avg_age)
for res in results:
    print(res)

Database connection Established
(Decimal('29.3333'),)

**String Function**
 * ltrim() - Removes spaces on left side of the character expression
 * lower() - converts all characters into lower cases
 * upper() - converts all characters into upper cases
 * reverse() - reverses all charactes in the string
 * substring() - gives sub string from original using slicing

In [46]:
l_trim = "select ltrim ('   Hello World!')"

results = read_table(connection,l_trim)
for res in results:
    print(res)

('Hello World!',)

In [47]:
r_trim = "select rtrim ('Hello World!    ')"

results = read_table(connection,r_trim)
for res in results:
    print(res)

('Hello World!',)

In [48]:
l_case= "select lower ('Hello World!')"

results = read_table(connection,l_case)
for res in results:
    print(res)

('hello world!',)

In [49]:
u_case= "select upper ('Hello World!')"

results = read_table(connection,u_case)
for res in results:
    print(res)

('HELLO WORLD!',)

In [50]:
r_string= "select reverse ('Hello World!')"

results = read_table(connection,r_string)
for res in results:
    print(res)

('!dlroW olleH',)

In [53]:
sub_string = "select substring('Today it seems to be rain' , 9 , 6)"

results = read_table(connection,sub_string)
for res in results:
    print(res)

(' seems',)

**CASE Statements - Used to make multiway decisions**

In [54]:
case_query = """
select *,
case
when e_salary < 85000 then 'C'
when e_salary < 100000 then 'B'
else 'A'
end as BAND
from emp_details;
"""

connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,case_query)
for res in results:
    print(res)

Database connection Established
(1, 'John', 95000, 45, 'Male', 'Operations', 'B')
(2, 'Vinay', 80000, 22, 'Male', 'Support', 'C')
(3, 'Bipul', 120000, 30, 'Male', 'Analytics', 'A')
(4, 'Anne', 112000, 25, 'Female', 'Sales', 'A')
(5, 'Jerry', 72000, 28, 'Female', 'Support', 'C')
(6, 'Ankita', 88000, 26, 'Female', 'Operations', 'B')

* IF() - It is an alternative to case statements

In [56]:
iiif_query = """select e_id,e_name,e_age, 
IF(e_age >= 30 , '2nd Gen' , '1st Gen')
as e_generation from emp_details"""

connection = db_conn("localhost","root","725@Mysql","mydb_emp")

results = read_table(connection,iiif_query)
for res in results:
    print(res)

Database connection Established
(1, 'John', 45, '2nd Gen')
(2, 'Vinay', 22, '1st Gen')
(3, 'Bipul', 30, '2nd Gen')
(4, 'Anne', 25, '1st Gen')
(5, 'Jerry', 28, '1st Gen')
(6, 'Ankita', 26, '1st Gen')

**Clauses in MySQL - OrderBy, GroupBy,having**

**Order By - to sort the data in ascending or descending order**

In [57]:
que = "select * from emp_details order by e_salary"

results = read_table(connection,que)
for res in results:
    print(res)

(5, 'Jerry', 72000, 28, 'Female', 'Support')
(2, 'Vinay', 80000, 22, 'Male', 'Support')
(6, 'Ankita', 88000, 26, 'Female', 'Operations')
(1, 'John', 95000, 45, 'Male', 'Operations')
(4, 'Anne', 112000, 25, 'Female', 'Sales')
(3, 'Bipul', 120000, 30, 'Male', 'Analytics')

In [58]:
que = "select * from emp_details order by e_salary DESC"

results = read_table(connection,que)
for res in results:
    print(res)

(3, 'Bipul', 120000, 30, 'Male', 'Analytics')
(4, 'Anne', 112000, 25, 'Female', 'Sales')
(1, 'John', 95000, 45, 'Male', 'Operations')
(6, 'Ankita', 88000, 26, 'Female', 'Operations')
(2, 'Vinay', 80000, 22, 'Male', 'Support')
(5, 'Jerry', 72000, 28, 'Female', 'Support')

**Top 3 Rows**

In [61]:
que = "select * from emp_details limit 3"
results = read_table(connection,que)
for res in results:
    print(res)

(1, 'John', 95000, 45, 'Male', 'Operations')
(2, 'Vinay', 80000, 22, 'Male', 'Support')
(3, 'Bipul', 120000, 30, 'Male', 'Analytics')

In [62]:
#select top 3 rows from emp details order by e_age in desc order

que = "select * from emp_details order by e_age DESC limit 3"
results = read_table(connection,que)
for res in results:
    print(res)

(1, 'John', 95000, 45, 'Male', 'Operations')
(3, 'Bipul', 120000, 30, 'Male', 'Analytics')
(5, 'Jerry', 72000, 28, 'Female', 'Support')

**Group By - Used to get aggregate result with respect to a group**

In [70]:
#Average Salary of Male and female

que = "select avg(e_salary),e_gender from emp_details group by e_gender"
results = read_table(connection,que)
for res in results:
    print(res)

(Decimal('98333.3333'), 'Male')
(Decimal('90666.6667'), 'Female')

In [71]:
#Average salary and average Age by department
que = "select avg(e_salary),avg(e_age),e_dept from emp_details group by e_dept"
results = read_table(connection,que)
for res in results:
    print(res)

(Decimal('91500.0000'), Decimal('35.5000'), 'Operations')
(Decimal('76000.0000'), Decimal('25.0000'), 'Support')
(Decimal('120000.0000'), Decimal('30.0000'), 'Analytics')
(Decimal('112000.0000'), Decimal('25.0000'), 'Sales')

In [73]:
#Average salary and average Age by department ordering the result by age
que = """select avg(e_salary),avg(e_age),e_dept 
from emp_details group by e_dept order by avg(e_age)"""

results = read_table(connection,que)
for res in results:
    print(res)

(Decimal('76000.0000'), Decimal('25.0000'), 'Support')
(Decimal('112000.0000'), Decimal('25.0000'), 'Sales')
(Decimal('120000.0000'), Decimal('30.0000'), 'Analytics')
(Decimal('91500.0000'), Decimal('35.5000'), 'Operations')

In [74]:
#Average salary and average Age by department ordering the result by salary
que = """select avg(e_salary),avg(e_age),e_dept 
from emp_details group by e_dept order by avg(e_salary)"""

results = read_table(connection,que)
for res in results:
    print(res)

(Decimal('76000.0000'), Decimal('25.0000'), 'Support')
(Decimal('91500.0000'), Decimal('35.5000'), 'Operations')
(Decimal('112000.0000'), Decimal('25.0000'), 'Sales')
(Decimal('120000.0000'), Decimal('30.0000'), 'Analytics')

In [75]:
#Average salary and average Age by department ordering the result by age in descending order

que = """select avg(e_salary),avg(e_age),e_dept 
from emp_details group by e_dept order by avg(e_age) desc"""

results = read_table(connection,que)
for res in results:
    print(res)

(Decimal('91500.0000'), Decimal('35.5000'), 'Operations')
(Decimal('120000.0000'), Decimal('30.0000'), 'Analytics')
(Decimal('76000.0000'), Decimal('25.0000'), 'Support')
(Decimal('112000.0000'), Decimal('25.0000'), 'Sales')

**Having Clauses - Used with groupby to impose conditions on groups**

In [80]:
que = """select e_dept, avg(e_salary) from emp_details group by e_dept 
having avg(e_salary) > 100000"""

results = read_table(connection,que)
for res in results:
    print(res)

('Analytics', Decimal('120000.0000'))
('Sales', Decimal('112000.0000'))

In [83]:
que = """select e_name , e_dept, e_salary from emp_details where e_salary > 100000"""

results = read_table(connection,que)
for res in results:
    print(res)

('Bipul', 'Analytics', 120000)
('Anne', 'Sales', 112000)